<?php


namespace Database\Seeders\data;


class Products
{
    public static function getData(): array
    {
        $data1 = [
            [
                'name' => 'Процессор AMD Ryzen 9 5950X BOX',
                'slug' => 'processor-amd-ryzen-9-5950x-box',
                'category_id' => 6,
                'sku' => '100-100000059WOF',
                'brand_id' => 1,
                'short_descr' => 'AM4, 16 x 3.4 ГГц, L2 - 8 МБ, L3 - 64 МБ, 2хDDR4-3200 МГц, TDP 105 Вт',
                'price' => 36999,
                'description' => 'Этот лучший в мире процессор для настольных ПК гарантирует прекрасную производительность, идеально подходящий для игр и творчества.
Сотрите границу между элитной производительностью для игр и рабочей станцией для создания контента благодаря самым передовым процессорам для настольных ПК в мире.
Высокопроизводительная архитектура ядер «Zen 3» компании AMD позволяет процессорам Ryzen 9 5950X, развивать более высокую производительность в одно- и многопотоковом режимах, чем любой другой процессор для настольных ПК. Эта необходимая для успеха геймеров и разработчиков контента производительность помогает побеждать.',
            ],

            [
                'name' => 'Процессор AMD Ryzen 7 5800X BOX',
                'slug' => 'processor-amd-ryzen-7-5800x-box',
                'category_id' => 6,
                'sku' => '100-100000063WOF',
                'brand_id' => 1,
                'short_descr' => 'AM4, 8 x 3.8 ГГц, L2 - 4 МБ, L3 - 32 МБ, 2хDDR4-3200 МГц, TDP 105 Вт',
                'price' => 21999,
                'description' => 'Базирующийся на архитектуре Zen 3 процессор AMD Ryzen 7 5800X BOX способен эффективно работать в составе производительного игрового компьютера. Устройство имеет 8 ядер. Потенциал процессора полностью реализуется благодаря значительному (32 МБ) объему кеш-памяти L3. Базовая частота модели равна 3800 МГц, а максимальная частота в турборежиме – 4700 МГц. Встроенное видеоядро отсутствует.
Процессор AMD Ryzen 7 5800X BOX гарантированно совместим с памятью DDR4, использующей частоты от 1600 до 3200 МГц. Максимальный объем памяти – 128 ГБ. Энергопотребление процессора снижается благодаря поддержке технологии Pure Power.
Несмотря на коробочную комплектацию, кулер вместе с процессором не поставляется. При выборе системы охлаждения необходимо ориентироваться на показатель TDP, равный 105 Вт. Безопасная температура эксплуатации процессора – до 90 °C.',
            ],

            [
                'name' => 'Процессор AMD Ryzen 9 5900X BOX',
                'slug' => 'processor-amd-ryzen-9-5900x-box',
                'category_id' => 6,
                'sku' => '100-100000061WOF',
                'brand_id' => 1,
                'short_descr' => 'AM4, 12 x 3.7 ГГц, L2 - 6 МБ, L3 - 64 МБ, 2хDDR4-3200 МГц, TDP 105 Вт',
                'price' => 29499,
                'description' => 'Ryzen 9 5900X - лучший игровой процессор в мире.
Сотрите границу между элитной производительностью для игр и рабочей станцией для создания контента благодаря самым передовым процессорам для настольных ПК в мире.
Высокопроизводительная архитектура ядер «Zen 3» компании AMD позволяет процессорам Ryzen 9 5900X, развивать более высокую производительность в одно- и многопотоковом режимах, чем любой другой процессор для настольных ПК. Эта необходимая для успеха геймеров и разработчиков контента производительность помогает побеждать.',
            ],

            [
                'name' => 'Процессор AMD Ryzen 5 7600X BOX',
                'slug' => 'processor-amd-ryzen-5-7600x-box',
                'category_id' => 6,
                'sku' => '100-100000593WOF',
                'brand_id' => 1,
                'short_descr' => 'AM5, 6 x 4.7 ГГц, L2 - 6 МБ, L3 - 32 МБ, 2хDDR5-5200 МГц, AMD Radeon Graphics, TDP 105 Вт',
                'price' => 22999,
                'description' => 'Процессор AMD Ryzen 5 7600X – это мощное решение для игровых систем и рабочих станций. В основе модели используются высококачественные компоненты и передовые технологии, что в связке с большим числом физических ядер и виртуальных потоков может обеспечить непревзойденно высокую вычислительную мощность в любых сценариях использования компьютера.
Поддерживаемые AMD Ryzen 5 7600X частоты могут варьироваться от 4.7 до 5.3 ГГц. Благодаря этому, а также свободному множителю данная модель отличается высоким уровнем быстродействия и большим потенциалом для его дальнейшего развития.
Объем поддерживаемой временной памяти может достигать 128 ГБ. Также вычислительный модуль поддерживает работу с интерфейсом PCI-E 5 поколения, что открывает широкие возможности для создания бескомпромиссной компьютерной системы для работы и развлечений.
Помимо высокой производительности процессор также отличается тепловыделением, которое не превышает 105 Вт. Для охлаждения могут использоваться как воздушные, так и водяные системы. Установка на материнскую плату производится при помощи сокета AM5.',
            ],

            [
                'name' => 'Процессор AMD Ryzen 9 7900X BOX',
                'slug' => 'processor-amd-ryzen-9-7900x-box',
                'category_id' => 6,
                'sku' => '100-100000589WOF',
                'brand_id' => 1,
                'short_descr' => 'AM5, 12 x 4.7 ГГц, L2 - 12 МБ, L3 - 64 МБ, 2хDDR5-5200 МГц, AMD Radeon Graphics, TDP 170 Вт',
                'price' => 40999,
                'description' => 'Процессор AMD Ryzen 9 7900X – это мощное решение для игровых систем и рабочих станций. В основе модели используются высококачественные компоненты и передовые технологии, что в связке с большим числом физических ядер и виртуальных потоков может обеспечить непревзойденно высокую вычислительную мощность в любых сценариях использования компьютера.
Поддерживаемые AMD Ryzen 9 7900X частоты могут варьироваться от 4.7 до 5.6 ГГц. Благодаря этому, а также свободному множителю данная модель отличается высоким уровнем быстродействия и большим потенциалом для его дальнейшего развития.
Объем поддерживаемой временной памяти может достигать 128 ГБ. Также вычислительный модуль поддерживает работу с интерфейсом PCI-E 5 поколения, что открывает широкие возможности для создания бескомпромиссной компьютерной системы для работы и развлечений.
Помимо высокой производительности процессор также отличается тепловыделением, которое не превышает 170 Вт. Для охлаждения могут использоваться как воздушные, так и водяные системы. Установка на материнскую плату производится при помощи сокета AM5.',
            ],

            [
                'name' => 'Процессор Intel Core i5-13400F BOX',
                'slug' => 'processor-intel-core-i5-13400f-box',
                'category_id' => 6,
                'sku' => 'BX8071513400F',
                'brand_id' => 2,
                'short_descr' => 'LGA 1700, 6P x 2.5 ГГц, 4E x 1.8 ГГц, L2 - 9.5 МБ, L3 - 20 МБ, 2хDDR4, DDR5-4800 МГц, TDP 148 Вт',
                'price' => 19999,
                'description' => 'Процессор Intel Core i5-13400F – чип со сбалансированной производительностью. Можно использовать его для создания различных сборок. При изготовлении применялся технологический процесс 10 нм. Он позволяет добиться небольшого потребления энергии и тепловыделения. Процессор выполнен с применением архитектуры Raptor Lake. Она позволила поднять производительность в сравнении с чипами прошлого поколения. Используется десять ядер и шестнадцать потоков для обработки информации.',
            ],

            [
                'name' => 'Процессор Intel Core i9-13900 BOX',
                'slug' => 'processor-intel-core-i9-13900-box',
                'category_id' => 6,
                'sku' => 'BX8071513900',
                'brand_id' => 2,
                'short_descr' => 'LGA 1700, 8P x 2 ГГц, 16E x 1.5 ГГц, L2 - 32 МБ, L3 - 36 МБ, 2хDDR4, DDR5-5600 МГц, Intel UHD Graphics 770, TDP 219 Вт',
                'price' => 55999,
                'description' => 'Процессор Intel Core i9-13900 выполнен на базе архитектуры Raptor Lake-S, использует техпроцесс 10 нм и отличается высокой производительностью и эффективностью, что позволит с легкостью выполнять любые задачи. Благодаря этому данная модель может стать отличным выбором для игровых систем и мощных рабочих станций.
За производительность Intel Core i9-13900 отвечает 8 производительных, 16 энергоэффективных ядер и 32 потока, которые могут работать в широком диапазоне частот. Благодаря этому, а также большому кэшу разных уровней процессор может обеспечить высокое быстродействие в самых разных условиях. Другой особенностью является поддержка до 128 ГБ оперативной памяти, что позволит создать бескомпромиссное решение для работы и развлечений.',
            ],

            [
                'name' => 'Процессор Intel Core i7-12700K BOX',
                'slug' => 'processor-intel-core-i7-12700k-box',
                'category_id' => 6,
                'sku' => 'BX8071512700K',
                'brand_id' => 2,
                'short_descr' => 'LGA 1700, 8P x 3.6 ГГц, 4E x 2.7 ГГц, L2 - 12 МБ, L3 - 25 МБ, 2хDDR4, DDR5-4800 МГц, Intel UHD Graphics 770, TDP 190 Вт',
                'price' => 31499,
                'description' => 'Процессор Intel Core i7-12700K BOX станет отличным выбором для пользователей, планирующих собрать игровой компьютер или высококлассный системный блок для решения универсальных задач. Главная особенность модели – наличие интегрированного графического ядра. Вы сможете отказаться от использования видеокарты. При этом ничто не мешает установить видеоадаптер необходимого уровня позже.
Процессор Intel Core i7-12700K BOX имеет 12 ядер, 8 из которых являются производительными, а 4 – энергоэффективными. Базовая частота устройства равна 3.6 ГГц. Максимальная частота в турборежиме существенно выше – 5 ГГц. Высочайший уровень производительности процессора помогает обеспечивать кэш-память значительного объема. В наличии 12-мегабайтный кэш L2 и 25-мегабайтный кэш L3.
Процессор совместим с модулями ОЗУ DDR4 и DDR5. Предусмотрена поддержка памяти ECC, которая может быть полезна при создании профессиональных рабочих станций. Максимальный объем оперативной памяти – 128 ГБ. При выборе системы охлаждения (в комплекте кулер отсутствует) нужно учитывать показатель TDP, равный 195 Вт.',
            ],

            [
                'name' => 'Процессор Intel Core i7-11700KF BOX',
                'slug' => 'processor-intel-core-i7-11700kf-box',
                'category_id' => 6,
                'sku' => 'BX8070811700KF',
                'brand_id' => 2,
                'short_descr' => 'LGA 1200, 8 x 3.6 ГГц, L2 - 4 МБ, L3 - 16 МБ, 2хDDR4-3200 МГц, TDP 125 Вт',
                'price' => 26599,
                'description' => 'Процессор Intel Core i7-11700KF BOX обеспечит бескомпромиссную производительность вашего компьютера в самых разных задачах. Данная модель использует в своей основе архитектуру Rocket Lake-S и техпроцесс 14 нм, что отличает ее технологичностью и высокой вычислительной мощностью. За это в процессоре отвечает 8 физических и 16 виртуальных потоков, которые отличаются широким рабочим диапазоном частот и возможность дополнительного разгона за счет свободного множителя. Графический чип в процессоре отсутствует, что снижает нагрузку на модуль и позволяет использовать любые дискретные видеокарты. Другой особенностью модели является поддержка до 128 ГБ оперативной памяти, что позволит создать бескомпромиссное решение для работы и развлечений.
Процессор Intel Core i7-11700KF BOX также отличается своим тепловыделением, которое составляет 125 Вт. Модель поставляется без системы охлаждения, но при этом поддерживает сторонние модули охлаждения воздушного или водяного типа. Для установки на материнскую плату используется сокет LGA 1200.',
            ],

            [
                'name' => 'Процессор Intel Core i7-13700KF BOX',
                'slug' => 'processor-intel-core-i7-13700kf-box',
                'category_id' => 6,
                'sku' => 'BX8071513700KF-SRMB9',
                'brand_id' => 2,
                'short_descr' => 'LGA 1700, 8P x 3.4 ГГц, 8E x 2.5 ГГц, L2 - 24 МБ, L3 - 30 МБ, 2хDDR4, DDR5-5600 МГц, TDP 253 Вт',
                'price' => 41999,
                'description' => 'Процессор Intel Core i7-13700KF выполнен на базе архитектуры Raptor Lake-S, использует техпроцесс 7 нм и отличается высокой производительностью и эффективностью, что позволит с легкостью выполнять любые задачи. Благодаря этому данная модель может стать отличным выбором для игровых систем и мощных рабочих станций.
За производительность Intel Core i7-13700KF отвечает 8 производительных, 8 энергоэффективных ядер и 24 потока, которые могут работать в широком диапазоне частот с возможностью дополнительного разгона за счет свободного множителя. Благодаря этому, а также большому кэшу разных уровней процессор может обеспечить высокое быстродействие в самых разных условиях. Другой особенностью является поддержка до 128 ГБ оперативной памяти, что позволит создать бескомпромиссное решение для работы и развлечений. Процессор использует сокет LGA 1700 и свежий чипсет 600 серии.',
            ],
        ];


        foreach ($data1 as $product) {
            $date = now()->subDays(rand(1, 90));
            $product['created_at'] = $date;
            $product['updated_at'] = $date;
        }

        return $data1;
    }
}
