<?php


namespace Database\Seeders\data;


class ProductSpecificationList
{
    public static function getData(): array
    {
        $product_spec_list1 = [
            // Серия
            [
                'AMD Ryzen 9',
                'AMD Ryzen 7',
                'AMD Ryzen 5',
                'Intel Core i5',
                'Intel Core i7',
                'Intel Core i9',
            ],
            // Модель
            [
                '5950X',
                '5900X',
                '5800X',
                '5700X',
                '7950X',
                '7900X',
                '7600X',
                '5600X',
                'i7-11700KF',
                'i7-12700K',
                'i5-13400F',
                'i5-12400',
                'i7-13700KF',
                'i9-13900',
                'i9-12900K',
            ],
            // Сокет
            [
                'AM4',
                'AM5',
                'LGA 1200',
                'LGA 1700',
            ],
            // Год релиза
            [
                '2019',
                '2020',
                '2021',
                '2022',
            ],
            // Ядро
            [
                'AMD Matisse (Zen 2)',
                'AMD Vermeer (Zen 3)',
                'AMD Raphael (Zen 4)',
                'Intel Rocket Lake-S',
                'Intel Alder Lake-S',
                'Intel Raptor Lake-S',
            ],
            [
                'TSMC 7FF',
                'TSMC 5FF',
                'TSMC 3FF',
                'Intel 14',
                'Intel 10',
                'Intel 7',
            ],
            [
                32,
                24,
                16,
                12,
                8,
                6,
            ],
            [
                32,
                24,
                16,
                12,
                8,
            ],
            [
                32,
                24,
                16,
                12,
                8,
                6,
            ],
            [
                16,
                12,
                8,
                6,
                'нет',
            ],
            [
                4,
                6,
                8,
                12,
            ],
            [
                16,
                32,
                48,
                64,
            ],
            [
                2.8,
                3,
                3.2,
                3.4,
                3.6,
            ],
            // Максимальная частота в турбо режиме
            [
                4.4,
                4.6,
                4.8,
                5,
                5.2,
            ],
            // Базовая частота энергоэффективных ядер
            [
                2.4,
                2.6,
                2.8,
                'нет',
            ],
            // Частота в турбо режиме энергоэффективных ядер
            [
                3.8,
                4,
                4.2,
                'нет',
            ],
            // Свободный множитель
            [
                'есть',
                'нет',
            ],
            // Тип памяти
            [
                'DDR3',
                'DDR4',
                'DDR5',
            ],
            // Максимально поддерживаемый объем памяти
            [
                32,
                64,
                128,
            ],
            // Количество каналов
            [
                2,
                4,
            ],
            // Максимальная частота оперативной памяти
            [
                3200,
                3600,
                4800,
                5600,
            ],
            // Поддержка режима ECC
            [
                'есть',
                'нет',
            ],
            // Тепловыделение (TDP)
            [
                35,
                65,
                90,
                105,
                120,
                170,
            ],
            // Максимальная температура процессора
            [
                85,
                90,
                100,
                105,
            ],
            // Интегрированное графическое ядро
            [
                'Intel UHD Graphics 650',
                'Intel UHD Graphics 750',
                'Intel UHD Graphics 770',
                'нет',
            ],
            // Встроенный контроллер PCI Express
            [
                'PCI-E 3.0',
                'PCI-E 4.0',
                'PCI-E 5.0',
            ],
            // Число линий PCI Express
            [
                8,
                12,
                16,
                24,
            ],
        ];

        $product_spec_list2 = [
            // Модель
            [
                'WD Red IntelliPower',
                'Seagate Exos 7E10',
                'WD Gold',
                'Toshiba X300 Performance',
                'Seagate Exos 7E8',
                'WD Ultrastar DC HC310',
            ],
            // Назначение
            [
                'NAS',
                'корпоративный класс',
                'ПК-десктопы',
            ],
            // Объем HDD
            [
                '1',
                '2',
                '4',
                '6',
                '8',
                '10',
                '12',
            ],
            // Объем кэш-памяти
            [
                '64',
                '128',
                '256',
            ],
            // Скорость вращения шпинделя
            [
                '5400',
                '7200',
                '10000',
            ],
            // Максимальная скорость передачи данных
            [
                '92',
                '128',
                '160',
                '180',
            ],
            // Интерфейс
            [
                'SATA II',
                'SATA III',
            ],
            // Пропускная способность интерфейса
            [
                '3',
                '6',
            ],
            // Оптимизация под RAID-массивы
            [
                'есть',
                'нет',
            ],
            // Технология записи
            [
                'SMR',
                'CMR',
            ],
            // Ударостойкость при работе
            [
                '10',
                '30',
                '50',
            ],
            // Уровень шума во время работы
            [
                '14',
                '21',
                '27',
                '35',
            ],
            // Уровень шума в простое
            [
                '8',
                '15',
                '18',
                '20',
            ],
            // Гелиевое наполнение
            [
                'есть',
                'нет',
            ],
            // Число циклов позиционирования-парковки
            [
                '300000',
                '450000',
                '600000',
                '700000',
            ],
            // Максимальное энергопотребление
            [
                '3.7',
                '4.1',
                '4.8',
                '5.2',
            ],
            // Энергопотребление в режиме ожидания
            [
                '2.2',
                '2.8',
                '3.1',
                '3.4',
            ],
            // Максимальная рабочая температура
            [
                '50',
                '55',
                '60',
                '65',
            ],
            // Ширина
            [
                '98.1',
                '101.6',
            ],
            // Длина
            [
                '132',
                '147',
            ],
            // Толщина
            [
                '26.1',
                '22.3',
            ],
            // Вес
            [
                '475',
                '520',
                '580',
                '640',
            ],
        ];

        return $product_spec_list2;
    }
}
